# Задание 3:
# Вам дан список:
# numbers = [2,4,7,1,8.4,-3.3,7.1,-2,4,-1,7,-43,8,-3,6,9]
# Определите количество четных и не четных.
print('3 секция задание 1')
numbers = [
    2, 4, 7, 1, 8.4, -3.3, 7.1, -2.4, -1.7, -43, 8, -3, 6, 9]
even = 0.0
odd = 0.0
for i in numbers:
    if abs(int(i)) % 2 == 0:
        even += 1
    if abs(int(i)) % 2 != 0:
        odd += 1
print(f'Четных чисел - {even}')
print(f'Нечетных чисел - {odd}')