# Задание 4:
# Дан список  целых чисел:
# numbers = [0,2,4,7,1,8,0,-3,7,0,-2,4,0,0,-1,7,-43,0,8,-3,6,9]
# Создайте новый лист и замените отрицательные числа на -1, положительные на число 1, ноль оставить без изменения.
print('3 секция задание 4')
numbers1 = [
    0, 2, 4, 7, 1, 8, 0, -3, 7, 0, -2, 4, 0, 0, -1, 7, -43, 0, 8, -3, 6, 9
]
newlist = []
for i in numbers1:
    if i < 0:
        newlist.append(-1)
    if i > 0:
        newlist.append(1)
    if i == 0:
        newlist.append(0)
print(newlist)