# Задание 5:
# my_list = [2,4,6,8,10,1,3,5,7,9,11,13,17]
# Выведите все элементы списка с четными ИНДЕКСАМИ (то есть A[0], A[2], A[4], ... ])
print('3 секция задание 5')
my_list = [
    2, 4, 6, 8, 10, 1, 3, 5, 7, 9, 11, 13, 17
]
for i in range(len(my_list)):
    print(i)
    if i % 2 == 0:
        print(my_list[i], end=' ')
print()