# Задание 3:
    # Пользователь вводит сторону квадрата. Найдите периметр и площадь квадрата
a = int(input("Input a "))
p = 4 * a
s = a ** 2
print(p)
print(s)
