# Задание 4:
    # Вам даны несколько последовательностей чисел:
    # sequence_0 = (14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70',0)
    # sequence_1 = (14,10,35,45,'60',70,90,0,105,150,'70')
    # sequence_2 = (14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70',0.0)
    # sequence_3 = (14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70')

    # Нужно проверить, все ли числа в КАЖДОЙ последовательности уникальны.
    # Если в последовательности были найдены дубликаты ---> Выведите на экран: "Последовательность не уникальна."
    # Если в последовательности дубликатов найдено не было ---> Выведите на экран: "Последовательность уникальна."
    # Если в решении задания не присутствует цикл ---> Задание не защитано.

sequence_0 = (14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70',0)
sequence_1 = (14,10,35,45,'60',70,90,0,105,150,'70')
sequence_2 = (14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70',0.0)
sequence_3 = (14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70')
k = n = r = d = 0
for i in sequence_0:
    if i in sequence_1:
        k += 1
        print('Последовательность 1 и 2 не уникальны ')
        if k >= 1:
            break
    else:
        print('Последовательность 1 и 2 уникальны ')
        break
for i in sequence_1:
    if i in sequence_2:
        n += 1
        print('Последовательность 2 и 3 не уникальны ')
        if n >= 1:
            break
    else:
        print('Последовательность 2 и 3 уникальны ')
        break
for i in sequence_2:
    if i in sequence_3:
        r += 1
        print('Последовательность 3 и 4 не уникальны ')
        if r >= 1:
            break
    else:
        print('Последовательность 3 и 4 уникальны ')
        break
for i in sequence_3:
    if i in sequence_0:
        d += 1
        print('Последовательность 4 и 1 не уникальны ')
        if d >= 1:
            break
    else:
        print('Последовательность 4 и 1 уникальны ')
        break



